{
	"descriptionUrl": "/job_board_single.php",
	"profileUrl": "/createProfile.php",
	"disclaimer": "The above statements are intended to describe the general nature and level of work being performed by the people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required to perform this function. All personal may be required to perform duties outside of their normal responsibilities as needed.",
	"benefits": "DGS offers a competitive benefits package which includes medical and dental insurance and a 401K program. Employees also have the opportunity to earn flight privileges for themself and qualifying family members.",
	"legal": "Equal Opportunity/Affirmative Action Employer M/F/D/V",
	"jobs": {
		"283": {
			"title": "INDUSTRY SATISFACTION MONITOR - CUSTOMER SURVEYOR",
			"location": "TAMPA, FL",
			"summary": "An Industry Satisfaction Monitor (ISM) – Customer Surveyor has specific responsibility of distributing web-based invite cards to all passengers who pass through the airports at any given time in specific airport locations. Must be able to work a flexible schedule Monday-Friday job requires mobility (travel)",
			"details": [
				"Surveyors are to request the passengers to go online, at a later time, to complete the survey Productivity requirements include yielding a percentage of survey returns per month",
				"Ground and In-flight surveying is done. (Note; this is not a customer service related job)",
				"Work schedules are provided weekly and require excessive flexibility with consideration and provision to compensate personal appointments",
				"Surveyors are required to travel up to 25% of the time, will travel via airline 1 – 2 flights per week, and may remain away from home overnight one or two nights per week",
				"An Industry Satisfaction Monitor (ISM) Surveyor is responsible for arriving at a work location prepared for all surveying duties. This includes, carrying the cards on-board and being ready to distribute them upon arrival",
				"Maintaining program equipment such as a pager, airport permits and authorizations, cabinet key, and badges must be present at all times"
			],
			"qualifications": [
				"College degree preferred, with at least two years of experience in face-to-face sales positions.",
				"Must be able to approach passengers professionally and competently",
				"Must present professional appearance and be able to maintain composure and observational detachment in any situation",
				"Able to work autonomously as well as within a team. and follow through on all assignments",
				"Able to communicate professionally both orally and written",
				"Self-starter highly motivated with a positive attitude. Superior communication and people skills are necessary"
			],
			"additional": "This temporary assignment is potentially long term and could lead to possible temp-to-hire opportunities.  The hourly pay rate is $15.00 with an attractive benefits package, including flight privileges on Delta Air Lines"
		},
		"282": {
			"title": "WAREHOUSE LEAD",
			"location": "COLLEGE PARK, GA",
			"summary": "",
			"details": [
				"Supervise and/or accomplish the dispatch of  internal and external customer sales orders to meet or exceed the on time delivery performance goal of 97.5%",
				"Assist with contacting carriers and couriers via email or phone for local pick up or other shipping information",
				"Random documented quality checks of goods after shipment processing is complete, but customer order has not left the shipping dock",
				"Perform and record cycle and/or physical inventory counting.",
				"Pull parts from stock to support Sales Orders using a pick list.",
				"Inform Warehouse Office personnel of unknown cross-referenced, superseded or obsolete part numbers.",
				"Ensure that inventory transactions (i.e. stock-line issuing and adjustments) are completed upon every material movement",
				"Inspect, pack, label and weigh the materials for shipment attaching appropriate transport vendor and/or customs paperwork.",
				"Identify and eliminate any outdated, unserviceable or degraded material in the stockroom.",
				"Understand and abide by Hazardous Material Shipping regulations.",
				"Support the Hazardous Material Shipping Specialist as a back up during absence or heavy shipping volume",
				"Be available for after hours AOG duties as scheduled",
				"Create and maintain schedule for AOG employees"
			],
			"qualifications": [
				"Management skills related to warehouse employees",
				"Enforce policies and procedures of the Employee Handbook and those policies and procedures directly associated with the warehouse",
				"Problem solving-identifies and resolves problems in a timely manner; gathers and analyzes information; works well in group problem solving situations.",
				"Technical aptitude including interpreting FAA/EASA regulations and standards as they relate to approved aviation materials",
				"Strong knowledge of computers",
				"Create, implement, and sustain written “OJT” directions and training",
				"Data Entry"
			],
			"additional": "TThis is a temporary-to-hire opportunities with a starting salary of $33,280.00."
		}
	}
}